---
kind: other
id: Methods.T:Autodesk.Revit.DB.MultiSegmentGrid
source: html/87437a38-56ad-9295-3c11-f20c376f9691.htm
---
# MultiSegmentGrid Methods

Determine whether two Grids are members of the same GridChain.